fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_timer.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_MIS register.
//
//*****************************************************************************
#define TIMER_MIS_WUEMIS \
    0x00010000 // 32/64-Bit Wide GPTM Write Update
               // Error Masked Interrupt Status
#define TIMER_MIS_DMABMIS \
    0x00002000 // GPTM Timer B DMA Done Masked
               // Interrupt
#define TIMER_MIS_TBMMIS \
    0x00000800 // GPTM Timer B Match Masked
               // Interrupt
#define TIMER_MIS_CBEMIS \
    0x00000400 // GPTM Timer B Capture Mode Event
               // Masked Interrupt
#define TIMER_MIS_CBMMIS \
    0x00000200 // GPTM Timer B Capture Mode Match
               // Masked Interrupt
#define TIMER_MIS_TBTOMIS \
    0x00000100 // GPTM Timer B Time-Out Masked
               // Interrupt
#define TIMER_MIS_DMAAMIS \
    0x00000020 // GPTM Timer A DMA Done Masked
               // Interrupt
#define TIMER_MIS_TAMMIS \
    0x00000010                      // GPTM Timer A Match Masked
                                    // Interrupt
#define TIMER_MIS_RTCMIS 0x00000008 // GPTM RTC Masked Interrupt
#define TIMER_MIS_CAEMIS \
    0x00000004 // GPTM Timer A Capture Mode Event
               // Masked Interrupt
#define TIMER_MIS_CAMMIS \
    0x00000002 // GPTM Timer A Capture Mode Match
               // Masked Interrupt
#define TIMER_MIS_TATOMIS \
    0x00000001 // GPTM Timer A Time-Out Masked
               // Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_ICR register.
//
//*****************************************************************************
#define TIMER_ICR_WUECINT \
    0x00010000 // 32/64-Bit Wide GPTM Write Update
               // Error Interrupt Clear
#define TIMER_ICR_DMABINT \
    0x00002000 // GPTM Timer B DMA Done Interrupt
               // Clear
#define TIMER_ICR_TBMCINT \
    0x00000800 // GPTM Timer B Match Interrupt
               // Clear
#define TIMER_ICR_CBECINT \
    0x00000400 // GPTM Timer B Capture Mode Event
               // Interrupt Clear
#define TIMER_ICR_CBMCINT \
    0x00000200 // GPTM Timer B Capture Mode Match
               // Interrupt Clear
#define TIMER_ICR_TBTOCINT \
    0x00000100 // GPTM Timer B Time-Out Interrupt
               // Clear
#define TIMER_ICR_DMAAINT \
    0x00000020 // GPTM Timer A DMA Done Interrupt
               // Clear
#define TIMER_ICR_TAMCINT \
    0x00000010                       // GPTM Timer A Match Interrupt
                                     // Clear
#define TIMER_ICR_RTCCINT 0x00000008 // GPTM RTC Interrupt Clear
#define TIMER_ICR_CAECINT \
    0x00000004 // GPTM Timer A Capture Mode Event
               // Interrupt Clear
#define TIMER_ICR_CAMCINT \
    0x00000002 // GPTM Timer A Capture Mode Match
               // Interrupt Clear
#define TIMER_ICR_TATOCINT \
    0x00000001 // GPTM Timer A Time-Out Raw
               // Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAILR register.
//
//*****************************************************************************
#define TIMER_TAILR_M \
    0xFFFFFFFF // GPTM Timer A Interval Load
               // Register
#define TIMER_TAILR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBILR register.
//
//*****************************************************************************
#define TIMER_TBILR_M \
    0xFFFFFFFF // GPTM Timer B Interval Load
               // Register
#define TIMER_TBILR_S         0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAMATCHR
// register.
//
//*****************************************************************************
#define TIMER_TAMATCHR_TAMR_M 0xFFFFFFFF // GPTM Timer A Match Register
#define TIMER_TAMATCHR_TAMR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBMATCHR
// register.
//
//*****************************************************************************
#define TIMER_TBMATCHR_TBMR_M 0xFFFFFFFF // GPTM Timer B Match Register
#define TIMER_TBMATCHR_TBMR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPR register.
//
//*****************************************************************************
#define TIMER_TAPR_TAPSRH_M   0x0000FF00 // GPTM Timer A Prescale High Byte
#define TIMER_TAPR_TAPSR_M    0x000000FF // GPTM Timer A Prescale
#define TIMER_TAPR_TAPSRH_S   8
#define TIMER_TAPR_TAPSR_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPR register.
//
//*****************************************************************************
#define TIMER_TBPR_TBPSRH_M   0x0000FF00 // GPTM Timer B Prescale High Byte
#define TIMER_TBPR_TBPSR_M    0x000000FF // GPTM Timer B Prescale
#define TIMER_TBPR_TBPSRH_S   8
#define TIMER_TBPR_TBPSR_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPMR register.
//
//*****************************************************************************
#define TIMER_TAPMR_TAPSMRH_M \
    0x0000FF00                           // GPTM Timer A Prescale Match High
                                         // Byte
#define TIMER_TAPMR_TAPSMR_M  0x000000FF // GPTM TimerA Prescale Match
#define TIMER_TAPMR_TAPSMRH_S 8
#define TIMER_TAPMR_TAPSMR_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPMR register.
//
//*****************************************************************************
#define TIMER_TBPMR_TBPSMRH_M \
    0x0000FF00                           // GPTM Timer B Prescale Match High
                                         // Byte
#define TIMER_TBPMR_TBPSMR_M  0x000000FF // GPTM TimerB Prescale Match
#define TIMER_TBPMR_TBPSMRH_S 8
#define TIMER_TBPMR_TBPSMR_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAR register.
//
//*****************************************************************************
#define TIMER_TAR_M           0xFFFFFFFF // GPTM Timer A Register
#define TIMER_TAR_S           0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBR register.
//
//*****************************************************************************
#define TIMER_TBR_M           0xFFFFFFFF // GPTM Timer B Register
#define TIMER_TBR_S           0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAV register.
//
//*****************************************************************************
#define TIMER_TAV_M           0xFFFFFFFF // GPTM Timer A Value
#define TIMER_TAV_S           0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBV register.
//
//*****************************************************************************
#define TIMER_TBV_M           0xFFFFFFFF // GPTM Timer B Value
#define TIMER_TBV_S           0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_RTCPD register.
//
//*****************************************************************************
#define TIMER_RTCPD_RTCPD_M   0x0000FFFF // RTC Predivide Counter Value
#define TIMER_RTCPD_RTCPD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPS register.
//
//*****************************************************************************
#define TIMER_TAPS_PSS_M      0x0000FFFF // GPTM Timer A Prescaler Snapshot
#define TIMER_TAPS_PSS_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPS register.
//
//*****************************************************************************
#define TIMER_TBPS_PSS_M      0x0000FFFF // GPTM Timer A Prescaler Value
#define TIMER_TBPS_PSS_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPV register.
//
//*****************************************************************************
#define TIMER_TAPV_PSV_M      0x0000FFFF // GPTM Timer A Prescaler Value
#define TIMER_TAPV_PSV_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPV register.
//
//*****************************************************************************
#define TIMER_TBPV_PSV_M      0x0000FFFF // GPTM Timer B Prescaler Value
#define TIMER_TBPV_PSV_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_DMAEV register.
//
//*****************************************************************************
#define TIMER_DMAEV_TBMDMAEN \
    0x00000800 // GPTM B Mode Match Event DMA
               // Trigger Enable
#define TIMER_DMAEV_CBEDMAEN \
    0x00000400 // GPTM B Capture Event DMA Trigger
               // Enable
#define TIMER_DMAEV_CBMDMAEN \
    0x00000200 // GPTM B Capture Match Event DMA
               // Trigger Enable
#define TIMER_DMAEV_TBTODMAEN \
    0x00000100 // GPTM B Time-Out Event DMA
               // Trigger Enable
#define TIMER_DMAEV_TAMDMAEN \
    0x00000010 // GPTM A Mode Match Event DMA
               // Trigger Enable
#define TIMER_DMAEV_RTCDMAEN \
    0x00000008 // GPTM A RTC Match Event DMA
               // Trigger Enable
#define TIMER_DMAEV_CAEDMAEN \
    0x00000004 // GPTM A Capture Event DMA Trigger
               // Enable
#define TIMER_DMAEV_CAMDMAEN \
    0x00000002 // GPTM A Capture Match Event DMA
               // Trigger Enable
#define TIMER_DMAEV_TATODMAEN \
    0x00000001 // GPTM A Time-Out Event DMA
               // Trigger Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_ADCEV register.
//
//*****************************************************************************
#define TIMER_ADCEV_TBMADCEN \
    0x00000800 // GPTM B Mode Match Event ADC
               // Trigger Enable
#define TIMER_ADCEV_CBEADCEN \
    0x00000400 // GPTM B Capture Event ADC Trigger
               // Enable
#define TIMER_ADCEV_CBMADCEN \
    0x00000200 // GPTM B Capture Match Event ADC
               // Trigger Enable
#define TIMER_ADCEV_TBTOADCEN \
    0x00000100 // GPTM B Time-Out Event ADC
               // Trigger Enable
#define TIMER_ADCEV_TAMADCEN \
    0x00000010 // GPTM A Mode Match Event ADC
               // Trigger Enable
#define TIMER_ADCEV_RTCADCEN \
    0x00000008 // GPTM RTC Match Event ADC Trigger
               // Enable
#define TIMER_ADCEV_CAEADCEN \
    0x00000004 // GPTM A Capture Event ADC Trigger
               // Enable
#define TIMER_ADCEV_CAMADCEN \
    0x00000002 // GPTM A Capture Match Event ADC
               // Trigger Enable
#define TIMER_ADCEV_TATOADCEN \
    0x00000001 // GPTM A Time-Out Event ADC
               // Trigger Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_PP register.
//
//*****************************************************************************
#define TIMER_PP_ALTCLK  0x00000040 // Alternate Clock Source
#define TIMER_PP_SYNCCNT 0x00000020 // Synchronize Start
#define TIMER_PP_CHAIN   0x00000010 // Chain with Other Timers
#define TIMER_PP_SIZE_M  0x0000000F // Count Size
#define TIMER_PP_SIZE_16 \
    0x00000000 // Timer A and Timer B counters are
               // 16 bits each with an 8-bit
               // prescale counter
#define TIMER_PP_SIZE_32 \
    0x00000001 // Timer A and Timer B counters are
               // 32 bits each with a 16-bit
               // prescale counter

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_CC register.
//
//*****************************************************************************
#define TIMER_CC_ALTCLK 0x00000001 // Alternate Clock Source

#endif // __HW_TIMER_H__
